In [5]:
import numpy as np
import pandas as pd

In [6]:
customers = pd.read_csv("customers.csv")
logistics = pd.read_csv("logistics.csv")
products = pd.read_csv("products.csv")
sales = pd.read_csv("sales.csv")
stores = pd.read_csv("stores.csv")

In [8]:
logistics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17978 entries, 0 to 17977
Data columns (total 11 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   shipment_id          17978 non-null  int64
 1   sale_id              17978 non-null  int64
 2   origin_store_id      17978 non-null  int64
 3   destination_address  17978 non-null  object
 4   transport_mode       17978 non-null  object
 5   carrier              17978 non-null  object
 6   departure_date       17978 non-null  object
 7   arrival_date         17978 non-null  object
 8   status               17978 non-null  object
 9   distance             17978 non-null  int64
 10  cost                 17978 non-null  float64
dtypes: float64(1), int64(4), object(6)
memory usage: 1.5+ MB

In [9]:
customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   customer_id    5000 non-null   int64
 1   customer_name  5000 non-null   object
 2   customer_type  5000 non-null   object
 3   segment        5000 non-null   object
 4   city           5000 non-null   object
 5   region         5000 non-null   object
dtypes: int64(1), object(5)
memory usage: 234.5+ KB

In [4]:
products.head()

,product_id,product_name,category,sub_category,price
0,1,Смартфон Samsung Galaxy S20 A0,Электроника,Мобильные устройства,19116
1,2,Смартфон Samsung Galaxy S20 A0,Электроника,Мобильные устройства,16006
2,3,Смартфон Apple iPhone 13 A0,Электроника,Мобильные устройства,47930
3,4,Смартфон Apple iPhone 13 A0,Электроника,Мобильные устройства,20458
4,5,Планшет Huawei MatePad 11 A0,Электроника,Мобильные устройства,23238

In [ ]:
products[['product_id', 'product_name']]

     product_id                                  product_name
0             1                Смартфон Samsung Galaxy S20 A0
1             2                Смартфон Samsung Galaxy S20 A0
2             3                   Смартфон Apple iPhone 13 A0
3             4                   Смартфон Apple iPhone 13 A0
4             5                  Планшет Huawei MatePad 11 A0
..          ...                                           ...
777         778                 Беговая дорожка DFC T-2001 J9
778         779                 Беговая дорожка DFC T-2001 J9
779         780                 Беговая дорожка DFC T-2001 J9
780         781  Велотренажер Svensson Body Labs CrossLine J9
781         782                    Велотренажер Xizomy X10 J9

[782 rows x 2 columns]

In [12]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20000 entries, 0 to 19999
Data columns (total 8 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sale_id       20000 non-null  int64
 1   store_id      20000 non-null  int64
 2   customer_id   20000 non-null  int64
 3   product_id    20000 non-null  int64
 4   sale_date     20000 non-null  object
 5   quantity      20000 non-null  int64
 6   total_amount  20000 non-null  int64
 7   channel       20000 non-null  object
dtypes: int64(6), object(2)
memory usage: 1.2+ MB

In [13]:
stores.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   store_id    10 non-null     int64
 1   store_name  10 non-null     object
 2   store_type  10 non-null     object
 3   city        10 non-null     object
 4   region      10 non-null     object
 5   latitude    10 non-null     float64
 6   longitude   10 non-null     float64
dtypes: float64(2), int64(1), object(4)
memory usage: 692.0+ bytes

In [6]:
stores

,store_id,store_name,store_type,city,region,latitude,longitude
0,1,Store 1,Розничный,Москва,Центральный,40.1300,32.0745
1,2,Store 2,Розничный,Сочи,Южный,56.1164,36.1426
2,3,Store 3,Оптовый,Казань,Приволжский,53.9628,34.5946
3,4,Store 4,Розничный,Москва,Центральный,46.8050,30.7246
4,5,Store 5,Розничный,Санкт-Петербург,Северо-Западный,43.1096,39.4623
5,6,Store 6,Розничный,Новосибирск,Сибирский,59.1443,27.5707
6,7,Store 7,Розничный,Казань,Приволжский,46.7319,31.0408
7,8,Store 8,Розничный,Сочи,Южный,41.8549,36.5881
8,9,Store 9,Оптовый,Казань,Приволжский,41.9343,32.3704
9,10,Store 10,Розничный,Нижний Новгород,Центральный,56.9499,37.2341

In [12]:
products[products["product_name"] == 'Беговая дорожка DFC T-2001 D3'][['product_name', 'price']]

                      product_name  price
734  Беговая дорожка DFC T-2001 D3  79729
735  Беговая дорожка DFC T-2001 D3  74314
736  Беговая дорожка DFC T-2001 D3  93940
737  Беговая дорожка DFC T-2001 D3  98702

In [17]:
products['product_name'].unique()[-1::-10]

array(['Велотренажер Xizomy X10 J9',
       'Велотренажер Svensson Body Labs CrossLine G6',
       'Беговая дорожка DFC T-2001 D3',
       'Толстовка Nike Sportswear Club J9', 'Футболка Uniqlo Airism I8',
       'Спортивный костюм Adidas Tiro 23 H7',
       'Рубашка Tom Tailor Regular Fit G6', "Джинсы Levi's 511 Slim F5",
       'Куртка Columbia Powder Lite E4', 'Юбка Mango A-Line Denim D3',
       'Блузка H&M White Cotton C2', 'Платье Zara Floral Midi B1',
       "Кофемашина De'Longhi Magnifica S J9", 'Блендер Braun MQ 5235 I8',
       'Пылесос Dyson V11 Absolute H7', 'Мультиварка Redmond RMC-M90 G6',
       'Микроволновка Samsung Smart Oven 200 F5',
       'Стиральная машина Bosch Serie 6 WGG244 E4',
       'Стиральная машина Beko B20 D3',
       'Холодильник LG DoorCooling+ GA-B509 C2',
       'Холодильник Ariston A10 B1', 'Фитнес-браслет Xiaomi Mi Band 7 J9',
       'Смартфон Samsung Galaxy S20 J9', 'Смартфон Apple iPhone 13 I8',
       'Планшет Huawei MatePad 11 H7', 'Ноутбук Lenovo L235 G6',
       'Ноутбук ASUS ZenBook 14 F5', 'ПК Strom Депо I7 E4',
       'Монитор LG UltraGear 27GN950 D3', 'Наушники Sony WH-1000XM4 C2',
       'Наушники JBL Tune 510BT B1',
       'Умные часы Samsung Galaxy Watch 5 A0'], dtype=object)

In [8]:
products['product'] = products['product_name'].str.split().apply(lambda x: x[0])

In [14]:
products[['product_id', 'product_name', 'product']].to_excel('products_to_mass.xlsx', index=False)

In [15]:
products[['product_id', 'product_name', 'product']].to_csv('products_to_mass.csv', index=False)

In [19]:
stores[['store_name', 'latitude', 'longitude']]

  store_name  latitude  longitude
0    Store 1   40.1300    32.0745
1    Store 2   56.1164    36.1426
2    Store 3   53.9628    34.5946
3    Store 4   46.8050    30.7246
4    Store 5   43.1096    39.4623
5    Store 6   59.1443    27.5707
6    Store 7   46.7319    31.0408
7    Store 8   41.8549    36.5881
8    Store 9   41.9343    32.3704
9   Store 10   56.9499    37.2341